---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarContainerItem.Normal
source: html/6dc405d3-b991-42e7-b2b6-b8e00ac71908.htm
---
# Autodesk.Revit.DB.Structure.RebarContainerItem.Normal Property

A unit-length vector normal to the plane of the rebar

## Syntax (C#)
```csharp
public XYZ Normal { get; }
```